<?php

//===========================- Основные пути -===========================

/**
 * Путь к обработанным видеороликам.
 */
define('VIDEOS_PATH', 'storage/videos/processed/');

/**
 * Путь к исходным видеороликам
 */
define('VIDEOS_TEMP_PATH', 'storage/videos/sources/');

/**
 * Путь к изображениям видеороликов
 */
define('VIDEO_PREVIEWS_PATH', 'storage/previews/');

//=======================================================================

//================================- Сайт -===============================

/**
 * Название сайта.
 */
define('SITE_NAME', 'Beleme Studios');

/**
 * Кодовое название сайта, только цифры и буквы.
 * Используется в названии сессии и т. п.
 */
define('SITE_CODE_NAME', 'beleme');

/**
 * Имя изображения иконки сайта.
 */
define('SITE_ICON_NAME', 'beleme_icon.png');

/**
 * Доменное имя сайта.
 */
define('SITE_DOMAIN', 'beleme.local');

/**
 * Версия сайта.
 */
define('SITE_VERSION', '0.1 alpha');

//=======================================================================

//===============================- Видео -===============================

//Статусы видеороликов эпизодов
define('VIDEO_UPLOADED', 0);	//Загружено в папку очереди
define('VIDEO_PROCESSING', 1);	//Обрабатывается
define('VIDEO_PROCESSED', 2);	//Обработано

//Соотношение сторон изображения видеоролика
define('VIDEO_PREVIEW_AR_WIDTH', 16);
define('VIDEO_PREVIEW_AR_HEIGHT', 9);

//=======================================================================

//============================- Комментарии -============================

//Типы комментариев
define('COMMENT_TYPE_EPISODE', 0);	//Комментарий эпизода
define('COMMENT_TYPE_SEASON', 1);	//Комментарий сезона
define('COMMENT_TYPE_CHANNEL', 2);	//Комментарий канала

//=======================================================================

//============================- Уведомления -============================

define('NOTIFICATION_TYPE_CHANNEL', 0);
define('NOTIFICATION_TYPE_SEASON', 1);
define('NOTIFICATION_TYPE_EPISODE', 2);

//=======================================================================

//Имена таблиц
include 'tables.php';